<a href="https://colab.research.google.com/github/rogemaro/Data-With-Python-And-Pandas/blob/main/Clase_16_Concatenaci%C3%B3n_de_Data_Frames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install --upgrade pandas

In [ ]:
import pandas as pd
import numpy as np
pd.__version__

'1.3.4'

In [ ]:
pd.options.display.float_format = "{:.2f}".format #mostramos los numeros decimales dentro del proceso con dos crigras decimales

In [ ]:
np.set_printoptions(precision=1) #Mostramos dos decimales con la libreria numpy

In [ ]:
x1= np.random.rand(2, 5)*10#generamos valores aleatorios en una matris de dos filas y 5 columnas
x1

array([[6. , 1.4, 4.5, 8.5, 6.4],
       [8. , 1. , 7.8, 6.6, 0.9]])

In [ ]:
x2 = np.random.rand(2, 5)*-1

In [ ]:
np.concatenate([x1, x2])#unimos las dos matrices

array([[ 6. ,  1.4,  4.5,  8.5,  6.4],
       [ 8. ,  1. ,  7.8,  6.6,  0.9],
       [-0.9, -0.2, -0.9, -0.2, -0.4],
       [-0.5, -0.3, -0.1, -0.4, -0.8]])

In [ ]:
np.concatenate([x1, x2], axis = 1).shape#aquí especificamos que queremos unirlo desde la columnas

(2, 10)

Ahora realizaremos el proceso de concatenación con Pandas

In [ ]:
s1 = pd.Series(x1[0], index = ["a", "b", "c", "d", "e"])#definimos una serie de la cual solo vamos a tomar el valor de la fila 1(0)
s1

a   6.00
b   1.37
c   4.49
d   8.47
e   6.35
dtype: float64

In [ ]:
s2 = pd.Series(x2[0], index = ["c", "d", "e", "f", "g"])
s2

c   -0.94
d   -0.16
e   -0.95
f   -0.23
g   -0.36
dtype: float64

In [ ]:
pd.concat([s1, s2], axis=1)#concatenamos las dos series, según el indice

     0     1
a 6.00   NaN
b 1.37   NaN
c 4.49 -0.94
d 8.47 -0.16
e 6.35 -0.95
f  NaN -0.23
g  NaN -0.36

In [ ]:
s1.reset_index(drop=True)#hace un reseteo del indice

0   6.00
1   1.37
2   4.49
3   8.47
4   6.35
dtype: float64

In [ ]:
pd.concat([s1.reset_index(drop=True),s2.reset_index(drop=True)], axis = 1)

     0     1
0 6.00 -0.94
1 1.37 -0.16
2 4.49 -0.95
3 8.47 -0.23
4 6.35 -0.36

Ahora que sabemos como concatenar series, pasamos a concatenar Data Frames

In [ ]:
df1 = pd.DataFrame(np.random.rand(3,2)*10, columns = ["a", "b"])#vamos a crear un Data frame
df1

     a    b
0 3.29 4.65
1 3.69 7.46
2 5.04 1.19

In [ ]:
df2 = pd.DataFrame(np.random.rand(3,2)*-1, columns = ["a", "b"], index = [2, 3, 4])
df2

      a     b
2 -0.60 -0.10
3 -0.96 -0.81
4 -0.03 -0.67

In [ ]:
pd.concat([df1, df2])#concatenamos los dos dataframes

      a     b
0  3.29  4.65
1  3.69  7.46
2  5.04  1.19
2 -0.60 -0.10
3 -0.96 -0.81
4 -0.03 -0.67

In [ ]:
pd.concat([df1, df2],axis = 1)#Se concatenan por columnas compartiendo el mismo indice  2

     a    b     a     b
0 3.29 4.65   NaN   NaN
1 3.69 7.46   NaN   NaN
2 5.04 1.19 -0.60 -0.10
3  NaN  NaN -0.96 -0.81
4  NaN  NaN -0.03 -0.67

In [ ]:
pd.concat([df1, df2],axis = 1, join="inner")#concatenar dos data frames solo la fila que tienen el indice en común

     a    b     a     b
2 5.04 1.19 -0.60 -0.10

In [ ]:
pd.concat([df1.reset_index(drop=True), df2.reset_index(drop=True)],axis = 1)#concatenamos reseteando los indices para qu no coincidan las filas

     a    b     a     b
0 3.29 4.65 -0.60 -0.10
1 3.69 7.46 -0.96 -0.81
2 5.04 1.19 -0.03 -0.67

Vamos a unir dos dataframes con la función *append* que es mucho más fácil

In [ ]:
df1.append(df2).append(df2)#Se unen pegandose la segunda matriz debajo de la primera, podemos iterar muchos dataframes

      a     b
0  3.29  4.65
1  3.69  7.46
2  5.04  1.19
2 -0.60 -0.10
3 -0.96 -0.81
4 -0.03 -0.67
2 -0.60 -0.10
3 -0.96 -0.81
4 -0.03 -0.67

In [ ]:
df1.T

     0    1    2
a 3.29 3.69 5.04
b 4.65 7.46 1.19

In [ ]:
df1.T.append(df2.T).T#Para unirlos a traves de las columnas debemos de recurrir a las transpuestas

     a    b     a     b
0 3.29 4.65   NaN   NaN
1 3.69 7.46   NaN   NaN
2 5.04 1.19 -0.60 -0.10
3  NaN  NaN -0.96 -0.81
4  NaN  NaN -0.03 -0.67